app/controllers/dashboard_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"