app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params.merge(user_id: current_user.id))
    if @employee.save
---
INSERT INTO "employees" ("name", "employee_type", "user_id", "early_shift", "day_shift", "late_shift", "night_shift", "day_off_requests", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    # current_userに関連する従業員のみを取得
    @employee = current_user.employees.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    # current_userに関連する従業員のみを取得
    @employee = current_user.employees.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    # current_userに関連する従業員のみを取得
    @employee = current_user.employees.find(params[:id])
    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "employee_type" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["employee_type", "パート"], ["updated_at", "2024-06-26 09:09:37.304780"], ["id", 13]]

  def destroy
    # current_userに関連する従業員のみを取得
    @employee = current_user.employees.find(params[:id])
    @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]