app/controllers/shifts_controller.rb

  def index
    Rails.logger.debug "Calling set_month_data in ShiftsController#index"
    set_month_data(params[:year], params[:month])
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"